---
kind: property
id: P:Autodesk.Revit.DB.Architecture.Railing.CanReset
zh: 栏杆
source: html/a1ae830a-9923-a134-1f72-fff811863974.htm
---
# Autodesk.Revit.DB.Architecture.Railing.CanReset Property

**中文**: 栏杆

True if the railing can be reset, False otherwise.

## Syntax (C#)
```csharp
public bool CanReset { get; }
```

## Remarks
A Railing can be reset only if the railing was created in Revit later than version 9.1.